In [10]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [11]:
df.loc[2:4, ['name', 'age']]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [12]:
df.iloc[:2]

   age  name  num_children  num_pets state
0   23  john             2         0  iowa
1   78  mary             2         4    dc

In [13]:
df.loc[:,['age', 'state']]

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [14]:
df[df['age'] > 30]

   age  name  num_children  num_pets       state
1   78  mary             2         4          dc
4   45  bill             2         0  washington
5   33  lisa             1         0          dc

In [15]:
df.columns

Index([u'age', u'name', u'num_children', u'num_pets', u'state'], dtype='object')

In [16]:
df[df["num_pets"] > df["num_children"]]

   age  name  num_children  num_pets  state
1   78  mary             2         4     dc
3   19  jeff             1         5  texas

In [17]:
df[ (df["age"] > 40) & (df["num_pets"] > 0) ]

   age  name  num_children  num_pets state
1   78  mary             2         4    dc

In [18]:
df[ (df["age"] > 40) | (df["num_pets"] > 0) ]

   age  name  num_children  num_pets       state
1   78  mary             2         4          dc
3   19  jeff             1         5       texas
4   45  bill             2         0  washington

In [21]:
df.drop(["age", "num_children"], axis=1)

    name  num_pets       state
0   john         0        iowa
1   mary         4          dc
2  peter         0  california
3   jeff         5       texas
4   bill         0  washington
5   lisa         0          dc

In [22]:
df

   age   name  num_children  num_pets       state
0   23   john             2         0        iowa
1   78   mary             2         4          dc
2   22  peter             0         0  california
3   19   jeff             1         5       texas
4   45   bill             2         0  washington
5   33   lisa             1         0          dc

In [23]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [24]:
df[["age", "num_children", "num_pets"]].mean()

age             36.666667
num_children     1.333333
num_pets         1.500000
dtype: float64

In [26]:
import numpy as np
df[["age", "num_pets", "num_children"]].apply(lambda col: np.sum(col),axis=0)

age             220
num_pets          9
num_children      8
dtype: int64

In [27]:
df[["age"]]

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [28]:
df['age']

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [29]:
df[["age"]].apply(lambda x: x*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [30]:
df["new c"] = df["age"]*df["num_children"]

In [31]:
df

   age   name  num_children  num_pets       state  new c
0   23   john             2         0        iowa     46
1   78   mary             2         4          dc    156
2   22  peter             0         0  california      0
3   19   jeff             1         5       texas     19
4   45   bill             2         0  washington     90
5   33   lisa             1         0          dc     33

In [32]:
df.sort_values("age", ascending=True)

   age   name  num_children  num_pets       state  new c
3   19   jeff             1         5       texas     19
2   22  peter             0         0  california      0
0   23   john             2         0        iowa     46
5   33   lisa             1         0          dc     33
4   45   bill             2         0  washington     90
1   78   mary             2         4          dc    156

In [33]:
df

   age   name  num_children  num_pets       state  new c
0   23   john             2         0        iowa     46
1   78   mary             2         4          dc    156
2   22  peter             0         0  california      0
3   19   jeff             1         5       texas     19
4   45   bill             2         0  washington     90
5   33   lisa             1         0          dc     33

In [34]:
df[df.apply(lambda row: row["name"].startswith("j"), axis=1)]

   age  name  num_children  num_pets  state  new c
0   23  john             2         0   iowa     46
3   19  jeff             1         5  texas     19

In [41]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)
p = d.pivot(index='Item', columns='CType', values='USD')

In [36]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [37]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$

In [43]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$